CFD_outputData/case_02/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    CRAHinlet
    {
        type            patch;
        nFaces          113;
        startFace       677027;
    }
    CRAHoutlet
    {
        type            patch;
        nFaces          110;
        startFace       677140;
    }
    wall
    {
        type            wall;
        nFaces          37643;
        startFace       677250;
    }
    cab_inlet-z
    {
        type            wall;
        nFaces          5097;
        startFace       714893;
    }
    cab_inlet+z
    {
        type            wall;
        nFaces          5101;
        startFace       719990;
    }
    cab_outlet-z
    {
        type            wall;
        nFaces          5101;
        startFace       725091;
    }
    cab_outlet+z
    {
        type            wall;
        nFaces          5089;
        startFace       730192;
    }
)

// ************************************************************************* //
