CFD_outputData/case_02/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
	
	CRAHinlet
    {
        type            fixedValue;
        value			$internalField;
    }
    CRAHoutlet
    {
        type            fixedValue;
        value			$internalField;
    }
    wall
    {
        type            zeroGradient;
    }
    cab_inlet-z
    {
        type            zeroGradient;
		//type            fixedValue;
        //value			$internalField;
    }
    cab_inlet+z
    {
        type            zeroGradient;
		//type            fixedValue;
        //value			$internalField;
    }
    cab_outlet-z
    {
        type            fixedValue;
        value			$internalField;
    }
    cab_outlet+z
    {
        type            fixedValue;
        value			$internalField;
    }
}

// ************************************************************************* //
