CFD_outputData/case_02/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{	
	CRAHinlet
    {
        type            fixedValue;
		value			$internalField;
    }
    CRAHoutlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    cab_inlet-z
    {
        type            zeroGradient;
		//type            kqRWallFunction;
        //value           $internalField;
    }
    cab_inlet+z
    {
        type            zeroGradient;
		//type            kqRWallFunction;
        //value           $internalField;
    }
    cab_outlet-z
    {
        type            zeroGradient;
    }
    cab_outlet+z
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
